tutorials/multiform/specCellFoam/fccPotential/constant/effectiveTransportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      effectiveTransportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Deff            Deff [ 0 2 -1 0 0 0 0 ] ( 0.44033416 1.1074245e-09 1.5501673e-22 -3.8397239e-10 0.45134002 -2.9210851e-23 6.5730513e-25 -6.660594e-25 0.362783 );

DeffSymm        DeffII [ 0 2 -1 0 0 0 0 ] ( 0.58071575 -1.30142e-10 1.5615181e-22 -1.30142e-10 0.57660352 -3.0822939e-23 1.5615181e-22 -3.0822939e-23 0.362783 );

lambda          3.5184517;

CI              CI [ 0 1 0 0 0 0 0 ] ( 4.7626337e-18 2.7818018e-18 0 );

Ueff            Ueff [ 0 1 -1 0 0 0 0 ] ( 1.0033091 4.0495866e-08 -2.7188183e-24 );


// ************************************************************************* //
