tutorials/multiform/specCellFoam/fccPotential/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1488";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
31744
(
(1.4839004 0.00025171738 1.3155713e-24)
(1.4828919 0.00075553825 1.2432871e-27)
(1.4808786 0.0012591328 -1.3183848e-24)
(1.4778583 0.0017623488 2.8442164e-27)
(1.4738321 0.0022650318 1.3350943e-24)
(1.4688014 0.0027670246 4.5790624e-27)
(1.4627677 0.0032681659 -1.3548837e-24)
(1.4557331 0.00376829 6.1493745e-27)
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    solid_sphere4_4
    {
        type            noSlip;
    }
    solid_sphere5_5
    {
        type            noSlip;
    }
    solid_sphere6_6
    {
        type            noSlip;
    }
    solid_sphere13_13
    {
        type            noSlip;
    }
    top_cyc
    {
        type            cyclic;
    }
    bottom_cyc
    {
        type            cyclic;
    }
    left_cyc
    {
        type            cyclic;
    }
    right_cyc
    {
        type            cyclic;
    }
}


// ************************************************************************* //
