tutorials/multiform/specCellFoam/fccPotential/0/Up
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Up;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
31744
(
(-5.6843419e-12 -5.6843419e-12 -2.2376211e-45)
(-51.451707 -25.640042 -1.506593e-19)
(-51.932705 -25.66497 -4.4661118e-19)
(-52.441192 -25.68374 -1.4782203e-19)
(-52.978653 -25.69637 1.5702239e-19)
(-53.546625 -25.702883 -1.5102855e-19)
(-54.146708 -25.703314 -1.5751234e-19)
(-54.780564 -25.697702 -1.4790239e-19)
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    solid_sphere4_4
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
104
(
(-16.774294 -300.00542 -4.4420861e-19)
(-29.974268 -300.41862 2.5080676e-19)
(-22.011241 -299.80906 1.2195018e-18)
(-14.223125 -298.25373 -4.7716769e-19)
(-6.6705716 -295.87038 9.6706478e-19)
(0.63926542 -292.92207 1.2563738e-18)
(7.7042294 -289.71921 -2.9271482e-18)
(35.469027 -310.76584 4.990682e-17)
...
)
;
    }
    solid_sphere5_5
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
104
(
(-300.00538 -16.774323 -1.2471985e-19)
(-300.41865 -29.974274 -1.1607832e-18)
(-299.80906 -22.01124 -1.097127e-18)
(-298.25373 -14.223125 4.7716769e-19)
(-295.87038 -6.6705716 -9.6706478e-19)
(-292.92207 0.63926521 -1.3595213e-18)
(-289.7192 7.7042325 -1.5797721e-18)
(-310.76584 35.469027 -4.990682e-17)
...
)
;
    }
    solid_sphere6_6
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
104
(
(-49.395245 -250.66467 -3.4236723e-19)
(-42.275551 -252.4267 1.6368731e-18)
(-34.872687 -253.86688 3.5383368e-18)
(-27.297259 -255.01346 -1.5282518e-18)
(-19.590242 -255.88581 6.9696963e-19)
(-11.790537 -256.47972 3.9054447e-19)
(-3.9361572 -256.78141 -1.9033823e-18)
(3.9361793 -256.7814 5.3415144e-20)
...
)
;
    }
    solid_sphere13_13
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
104
(
(-7.7042259 -289.71923 -1.6117157e-18)
(-0.63927137 -292.92205 -4.3500844e-20)
(6.6705634 -295.87033 6.0673128e-19)
(14.223111 -298.25376 6.0242478e-20)
(22.011282 -299.80927 -0)
(29.974233 -300.41829 5.3880345e-19)
(16.774277 -300.00542 -2.5710416e-18)
(-41.250461 -287.73295 -5.2551047e-19)
...
)
;
    }
    top_cyc
    {
        type            cyclic;
    }
    bottom_cyc
    {
        type            cyclic;
    }
    left_cyc
    {
        type            cyclic;
    }
    right_cyc
    {
        type            cyclic;
    }
}


// ************************************************************************* //
