tutorials/multiform/specCellFoam/fccPotential/0/Upot
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Upot;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
31744
(
(0 0 -0)
(-0.51451707 -0.25640042 -1.506593e-21)
(-0.51932705 -0.2566497 -4.4661118e-21)
(-0.52441192 -0.2568374 -1.4782203e-21)
(-0.52978653 -0.2569637 1.5702239e-21)
(-0.53546625 -0.25702883 -1.5102855e-21)
(-0.54146708 -0.25703314 -1.5751234e-21)
(-0.54780564 -0.25697702 -1.4790239e-21)
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    solid_sphere4_4
    {
        type            calculated;
        value           nonuniform List<vector> 
104
(
(-0.16774294 -3.0000542 -4.4420861e-21)
(-0.29974268 -3.0041862 2.5080676e-21)
(-0.22011241 -2.9980906 1.2195018e-20)
(-0.14223125 -2.9825373 -4.7716769e-21)
(-0.066705716 -2.9587038 9.6706478e-21)
(0.0063926542 -2.9292207 1.2563738e-20)
(0.077042294 -2.8971921 -2.9271482e-20)
(0.35469027 -3.1076584 4.990682e-19)
...
)
;
    }
    solid_sphere5_5
    {
        type            calculated;
        value           nonuniform List<vector> 
104
(
(-3.0000538 -0.16774323 -1.2471985e-21)
(-3.0041865 -0.29974274 -1.1607832e-20)
(-2.9980906 -0.2201124 -1.097127e-20)
(-2.9825373 -0.14223125 4.7716769e-21)
(-2.9587038 -0.066705716 -9.6706478e-21)
(-2.9292207 0.0063926521 -1.3595213e-20)
(-2.897192 0.077042325 -1.5797721e-20)
(-3.1076584 0.35469027 -4.990682e-19)
...
)
;
    }
    solid_sphere6_6
    {
        type            calculated;
        value           nonuniform List<vector> 
104
(
(-0.49395245 -2.5066467 -3.4236723e-21)
(-0.42275551 -2.524267 1.6368731e-20)
(-0.34872687 -2.5386688 3.5383368e-20)
(-0.27297259 -2.5501346 -1.5282518e-20)
(-0.19590242 -2.5588581 6.9696963e-21)
(-0.11790537 -2.5647972 3.9054447e-21)
(-0.039361572 -2.5678141 -1.9033823e-20)
(0.039361793 -2.567814 5.3415144e-22)
...
)
;
    }
    solid_sphere13_13
    {
        type            calculated;
        value           nonuniform List<vector> 
104
(
(-0.077042259 -2.8971923 -1.6117157e-20)
(-0.0063927137 -2.9292205 -4.3500844e-22)
(0.066705634 -2.9587033 6.0673128e-21)
(0.14223111 -2.9825376 6.0242478e-22)
(0.22011282 -2.9980927 -0)
(0.29974233 -3.0041829 5.3880345e-21)
(0.16774277 -3.0000542 -2.5710416e-20)
(-0.41250461 -2.8773295 -5.2551047e-21)
...
)
;
    }
    top_cyc
    {
        type            cyclic;
    }
    bottom_cyc
    {
        type            cyclic;
    }
    left_cyc
    {
        type            cyclic;
    }
    right_cyc
    {
        type            cyclic;
    }
}


// ************************************************************************* //
